Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཚིག་པས་མེའི་ནང་དུ་བཅུག་པ་དེ་ལྟར་དེ་བཞིན་དུ་ཁྱོད་སྡུག་བསྔལ་མྱ་ངན་ལས་འདའ་བའི་ཐར་པ་ལ་བརྩོན་པས་ཉོན་མོངས་པ་ལས་ཐར་བར་བྱ་བའི་ཕྱིར་ཁྱོད་ཀྱི་གཟུགས་དེ་བཞིན་དུ་མཆོག་ཏུ་དཀའ་བ་སྤྱོད་པ་བདག་ལ་གནོད་པའི་རྗེས་སུ་སྦྱོར་བར་འགྱུར་རོ། །ཕྱི་ཕྱིར་ཡང་ཉོན་མོངས་པ་སྟུག་པོས་བཅིངས་ཤིང་བཏགས་པར་འགྱུར་རོ། །
en: Thus, you engage in practices that are extremely difficult on your physical body and harm yourself to become free from afflictions, but you will become increasingly bound and tied by severe afflictions.

source: སྡིག་པ་སྤོང་བ་བདག་ནི་གྲངས་མེད་པའི་བསྐལ་པ་ལས་ཤིན་ཏུ་འདས་པ་དང་། ཤིན་ཏུ་གྲངས་མེད་ཚད་མེད་པའི་རྣམ་པར་རྒྱས་པར་མངོན་པར་ཤེས་སོ། །གང་བདག་དེའི་དུས་དེའི་ཚེ་ན་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱལ་པོ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱི་མཛོད་ཅེས་བྱ་བ་དང་།
en: “Renouncers of misdeeds, I remember clearly that, countless eons ago, so long ago that the amount of time cannot be measured or fathomed, I was born as a king named Treasury of Light Rays of Merit in a buddha realm inundated with the five impurities.

source: དབུ་མའི་གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་གི་དབང་པོ་ཡང་ལོ་སྟོང་གི་བར་དུ་སྐྱེ་བར་གྱུར་ཏོ། །
en: I ruled for a thousand years over the four central continents and over Jambudvīpa.

source: དེའི་ཚེ་ན་ཡང་སེམས་ཅན་རྣམས་ཤིན་ཏུ་རྒ་ཤིའི་བགེགས་སུ་གྱུར་ཏོ། །དེའི་ཚེ་ན་སངས་རྒྱས་འབྱུང་བ་མེད་པ་དང་།
en: At that time, beings were extremely troubled by old age and death.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་མེད་པས་ཡང་དེའི་ཚེ་ན་རང་སངས་རྒྱས་སུ་གྱུར་པ་ཡང་མེད་དོ། །
en: A buddha had not appeared in the world, and there were no teachings of a buddha.

source: དྲང་སྲོང་ཡང་མེད་དེ་ཕྱི་མའི་དུས་ན་བདག་དགོན་པ་དང་ནགས་འདབ་ནས་འབྱུང་བར་གྱུར་ཏོ། །
en: There weren’t even any solitary buddhas, and there were no sages.

source: ལ་ལ་ལྷའི་བྱ་བ་ཁ་དོག་བཞི་དང་། ལུས་ཀྱི་སྟོབས་དང་ལྷན་ཅིག་པ་སྐྱིལ་མོ་ཀྲུང་བཅས་པ་དེ་ལ་བདག་དང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་བལྟ་བར་གྱུར་ཏོ། །
en: One day, I went to the jungle and saw many myriads of beings, some of them sitting cross-legged and displaying the four colors of the divine birds as well as physical strength.

source: ཟླ་བ་དང་ཉི་མས་བསྟོད་པ་དེ་ལ་བདག་གིས་དྲིས་པ། གང་བདག་གིས་བཟུང་ཞིང་བཏང་སྟེ།
en: I asked those beings who were praising the Sun and the Moon, ‘What afflicts you and what are you trying to get rid of?

source: དགོན་པ་དང་ནགས་འདབ་ཏུ་སྤྱོད་ཅིག་ཅེས་ཁྱོད་ལ་སྟོན་པ་སུ་དེས་སྨྲས་པ།
en: Who is the teacher that told you to go live in the jungle?’

source: བདག་ནི་རྒ་ཤིའི་བགེགས་སོ། །ཤུ་བས་ཡོངས་སུ་བཟུང་བ་དང་།
en: “They replied, ‘We are troubled by old age and death.

source: ནད་ཀྱིས་ཡོངས་སུ་བཟུང་བ་དང་། ཟུག་རྔུས་ཡོངས་སུ་བཟུང་བ་སྟེ། ཡོངས་སུ་བཟུང་བ་དེ་ཐམས་ཅད་བདག་གིས་གཏོང་བ་དང་། ནགས་འདབ་ཏུ་ཐར་པའི་ཐབས་མི་ཤེས་པས་ཉིན་མཚན་ཤིན་ཏུ་གཏོང་བར་གྱུར་ཏོ། །
en: We are afflicted by abscesses, diseases, and sharp pains, and we spend our days and nights in this forest, without knowing how to get rid of all those afflictions, or how to gain freedom.’

source: དེ་ལ་བདག་གིས་དྲི་བ་དྲིས་པ། ཁྱོད་ལ་སྟོན་པ་སུ།
en: “I asked them again, ‘Who is your teacher?’

source: དེས་སྨྲས་པ། ཉི་མ་དང་ཟླ་བ་གཉིས་བདག་གིས་བསྟན་ཏེ། རྒ་ཤི་འབྱུང་བ་ལ་བསྟེན་པར་ཡང་མི་ཤེས་སོ། །
en: “They replied, ‘The sun and the moon are both our teachers, but we do not know any refuge against the arising of old age and death.’

source: བདག་དེ་ལྟར་སེམས་སྐྱེས་པས་བདག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །བདག་གང་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ། གང་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་ལམ་འདི་མཐོང་བའང་མེད་དོ། །
en: “I thought, ‘I will ripen these beings and become an unsurpassed, perfect, completely awakened buddha, but I will not observe the path these beings follow.

source: བདག་ནི་མ་འོངས་པའི་དུས་ན་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་རྣམ་པར་གྲོལ་བའི་ལས་ཀྱི་སྒྲིབ་པའང་མེད་དོ། །བདག་དེ་ལས་ཕྱིར་ལོག་སྟེ།
en: In the future, I will be free from the karmic hindrances to the unobstructed wisdom of liberation.’

source: རང་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ཏེ་བདག་གིས་བུད་མེད་ཀྱི་རྩེ་བའི་རང་བཞིན་ཐམས་ཅད་སྤངས་ཤིང་རྒྱལ་པོའི་དགོས་པ་ཐམས་ཅད་བོར་ཏེ་ཉིན་མཚན་བདུན་དུ་ཁ་ཟས་མེད་པར་སོ་སོ་ནས་བསྡུས་ཏེ་ཐིམ་པ་གཅིག་ཏུ་སྤྱོད་པར་འགྱུར་རོ། །
en: “I then came back to my royal palace, completely renounced frolicking with girls, and gave up all my royal functions. I then remained for seven days and nights in a state of repose without eating any food.

source: བདག་དེ་བཞིན་དུ་སྨོན་ལམ་བསྐྱེད་དོ། །གལ་ཏེ་བདག་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་མདུན་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོས་པར་འགྱུར་རོ། །
en: I made this aspiration: ‘I dedicate the roots of virtue I have generated before myriads of buddhas to unsurpassed and perfect awakening.

source: དེ་འདི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་དགོངས་ཤིང་བདག་ནི་གང་ཕྱོགས་བཅུའི་ཚད་མེད་གྲངས་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གནས་སོ། །འཚོའོ། །སྐྱོང་ངོ་། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: May those buddhas consider me, and may I live in, thrive in, and sustain innumerable, countless world systems throughout the ten directions and teach the Dharma to beings out of great compassion.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེའི་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་སྟོན་ཅིང་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: May I teach the unobscured wisdom of the blessed buddhas and fulfill my every wish!

source: ཇི་ལྟར་བདག་དེ་འདྲ་བའི་ཉེ་བར་ལེན་པའི་རྙེད་པར་གྱུར་པ་གང་གི་ཐབས་ཀྱིས་གང་ལ་བདག་དེ་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་གཉེན་དུ་གྱུར། སེམས་ཅན་རྣམས་རྒ་ཤིའི་ལམ་མཐོང་བར་གྱུར།
en: May whatever method I might find related to such grasping be helpful for beings, and may those beings see the path that liberates from old age and death!

source: གལ་ཏེ་བདག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་མེད་པས་དེ་ལྟར་བདག་ཟས་དང་སྐོམ་ཡོངས་སུ་མི་ཟ་བ་ནས་བཀྲེས་ཤིང་སྐོམ་པས་ཤི་བར་བྱས་པའི་བར་དུ་མནར་མེད་པའི་དམྱལ་བ་ཆེན་པོ་མི་བཟད་པར་དྲག་ཅིང་ཚ་བའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྣམས་ཚོར་བར་འགྱུར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཕྱི་མའི་མཐའ་ལ་ཐུག་གི་བར་དུ་འཁོར་བ་ནི་ཆུང་ངུ་ན་སེམས་ཅན་གཅིག་ཀྱང་འཁོར་བ་ལས་གྲོལ་བ་མེད་དོ། །
en: Since I do not have the realization of the blessed buddhas, if I do not consume any food or drinks until I die from hunger and thirst I will then experience unbearable, intense, and scorching feelings of suffering in the great Hell of Endless Torment.

source: བདག་ཀྱང་དམྱལ་བ་ལས་ཡོངས་སུ་གྲོལ་བ་མེད་པ་ནི་གང་སྔོན་གྱི་མཐའ་ལ་ཐུག་པ་དང་། ཕྱི་མའི་མཐའ་ལ་ཐུག་པའི་སེམས་ཅན་རྣམས་ཉོན་མོངས་པ་སྐྱེ་བ་དང་།
en: In the future, all beings will remain in saṃsāra, not a single being will be liberated in the least, and I will not be liberated from the hell realms.

source: སྡུག་བསྔལ་སྐྱེ་བ་དང་སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་།
en: May all past and future beings born into affliction and born into suffering cast off the hindrances of beings, the hindrances of the afflictions, the hindrances of action, and hindrances to the Dharma.

source: ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་བོར་བར་འགྱུར་རོ། །ཡོངས་སུ་སྨིན་པ་མེད་པ་དང་། ཉམས་པ་མེད་པ་ཡོད་པས་ངན་འགྲོ་གསུམ་གྱི་ཆོས་རྣམ་པར་སྨིན་པ་དེ་ཐམས་ཅད་སེམས་ཅན་རྣམས་ཀྱི་དཀའ་བར་བྱས་པ་བདག་གི་ལུས་དམྱལ་བར་སྐྱེས་པས་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: May they be free from karmic ripening and from harm, and may all of the karmic ripening of the qualities of the three lower realms that make things difficult for beings ripen in my body when I am born in the hell realms!

source: གང་ཡང་ཕྱི་མའི་མཐའ་ལ་ཐུག་པའི་སེམས་ཅན་རྣམས་ངན་པར་བྱས་པའི་ལས་བོར་ཏེ། དེ་ཡང་བདག་གི་ལུས་དེ་ལྟར་མནར་མེད་པར་སྐྱེས་པ་རྣམ་པར་སྨིན་པར་འགྱུར།
en: May beings in the future cast off the karma of their negative actions, and may it ripen in my body when I am born in the Hell of Endless Torment!

source: གང་བདག་གིས་དགེ་བ་བསགས་པ་དེ་སེམས་ཅན་རྣམས་དགེ་བའི་ལས་མངོན་པར་བྱེད་པས་བདག་གིས་བསྡོས་སོ། །
en: I dedicate the virtue I have accumulated so that beings may bring about virtuous karma.

source: ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་མེད་པའི་ཁང་པར་གནས་པ་མེད་པར་གྱུར་པ། དེ་ལྟར་བདག་མནར་མེད་པའི་དམྱལ་བ་ཆེན་པོ་ལས་ཡོངས་སུ་གྲོལ་བ་མེད་དོ། །
en: Until all beings reside in a house that is free from fear, may I not be free from the great Hell of Endless Torment!’

source: སྡིག་པ་སྤོང་བ་དེ་ཉིན་མཚན་བདུན་དུ་ཁ་ཟས་མེད་པར་སྨོན་ལམ་གྱི་ཁྱད་པར་སྤྱོད་དོ། །
en: Renouncers of misdeeds, I made this special aspiration for seven days and nights without eating any food.

source: དེའི་དུས་ན་སྡིག་པ་སྤོང་བ་བྱང་ཕྱོགས་སུ་སོང་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ལས་ཤིན་ཏུ་འདས་པར་གྱུར་ཏོ། །དེ་ལ་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དགེ་བ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གྱུར་ཏོ། །དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཟོད་པའི་མཆོག་དཔལ་བརྩེགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་གནས་སོ། །འཚོའོ། །སྐྱོང་ངོ་། །དེ་ཐེག་པ་གསུམ་གྱི་ཆོས་རྣམས་ཀྱང་འཆད་དོ།། །།
en: “In the northern direction, renouncers of misdeeds, beyond more than ten million buddha realms, there is a buddha realm inundated with the five impurities called Virtue, where the blessed buddha King of the Glorious Heap of Supreme Acceptance resides, thrives, offers sustenance, and expounds the Dharma teachings of the three vehicles.

source: བམ་པོ་དགུ་པ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཟོད་པའི་མཆོག་དཔལ་གྱི་ཕུང་པོའི་རྒྱལ་པོས་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལས་འདས་ཏེ་སོང་ཤིག་དང་།
en: “The blessed thus-gone one King of the Glorious Heap of Supreme Acceptance said to the bodhisattva Light of Immaculate Splendor and to the other bodhisattvas, ‘Noble sons, you should go to the south, beyond 920,000,000 buddha realms.

source: དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་ན་གླིང་བཞི་པའི་དབུས་ཀྱི་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ཅེས་བྱ་བ་ཞིག་ཡོད་ཀྱིས་དེ་ལ་མེ་ཏོག་བན་དུའི་ཆུན་པོ་འདི་གཉིས་བྱིན་ཏེ་བཟོད་པའི་ཆོས་ཀྱི་གཞུང་འདི་ཁྲོལ་ཅིག །
en: There, in the buddha realm called Apportioned, in the middle of the four-continent world, there is a king named Treasury of Light Rays of Merit. Offer him these two bouquets of pentapetes flowers, and explain to him this Dharma scripture on acceptance.

source: ནམ་མཁའི་མདོག་གི་སྔགས་ཀྱི་ཚིག་འདི་རྗོད་ཅིག་དང་།
en: Tell him the words of this sky-colored mantra.

source: སྔགས་ཀྱི་ཚིག་དེས་རྒྱལ་པོ་དེ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཐོབ་བོ། །བཟོད་པ་དེས་རྒྱལ་པོ་དེ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྐྱེ་བ་དང་། སྡུག་བསྔལ་སྐྱེ་བ་དང་།
en: That king will attain the acceptance of discipline through taming beings with the sky-colored method of perfect conduct using that mantra.

source: སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པ་རབ་དང་། འབྲིང་དང་ཐ་མ་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །
en: This acceptance will completely exhaust the arising of afflictions, the arising of suffering, and all the severe, middling, and lesser hindrances of beings, the hindrances of the afflictions, the hindrances to the Dharma, and the hindrances of action and of the afflictions belonging to that king and all beings.

source: རྒྱལ་པོ་དེ་ཡང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དགེ་བའི་བཤེས་གཉེན་དུ་ལམ་སྟོན་པ་བསྟན་པར་གྱུར་ཏོ། །
en: That king will then act as a virtuous friend and show the path to myriads of beings.

source: རྒྱལ་པོ་དེ་ཡང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་སྨིན་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་དོ། །
en: He will ripen myriads of beings through the three vehicles, and he will swiftly awaken to unsurpassed and perfect buddhahood.’

source: དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པའི་འོད་ཆེན་པོ་དང་། ལྷ་དང་། དྲི་ཟའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེ་ཡང་བཟོད་པའི་མཆོག་དཔལ་གྱི་ཕུང་པོའི་རྒྱལ་པོ་དེ་ལ་ཕྱིར་མཉན་ནས་དེ་བཞིན་གཤེགས་པ་བཟོད་པའི་མཆོག་དཔལ་གྱི་ཕུང་པོའི་རྒྱལ་པོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་དེ་ལ་འདི་སྐད་ཅེས་སྨྲོས་ཤིག །
en: “As the bodhisattva Great Light of Immaculate Splendor, the other bodhisattvas, and the entire assembly of gods and gandharvas listened to the Thus-Gone One King of the Glorious Heap of Supreme Acceptance, he continued, ‘Noble sons, say to King Treasure of the Light Rays of Merit, “Just as the realm of phenomena that is naturally devoid of affliction should be understood through the gateway to the Dharma of nonduality, Great King, the gateway of the forms perceived by the eyes can reveal nonduality, the absence of passing away, and the absence of being reborn.

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་རང་བཞིན་གྱིས་ཉོན་མོངས་པ་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོས་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དེ་ལྟར་མིག་གི་གཟུགས་ཀྱི་སྒོ་འཕོས་པ་མེད་ཅིང་རྣམ་པར་ཕྱེ་བ་མེད་པ་གཉིས་སུ་མེད་པ་སྟོན་པར་འགྱུར་བ་ནས་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་དུ་འཕོས་པ་མེད་ཅིང་རྣམ་པར་ཕྱེ་བ་མེད་པ་གཉིས་སུ་མེད་པར་སྟོན་པར་འགྱུར་རོ། །
en: Furthermore, the gateway of those phenomena up to the mental consciousness can likewise reveal nonduality, the absence of passing away, and the absence of being reborn.

source: ཆོས་ཐམས་ཅད་སེམས་ཅན་མེད་པ་ནི་སེམས་ཅན་དང་བྲལ་བའོ། །
en: Because all phenomena are devoid of sentient beings and are free from sentient beings.

source: ཆོས་ཐམས་ཅད་སྲོག་མེད་པ་ནི་སྲོག་གི་སྒྲས་བསྟན་པའོ། །
en: All phenomena that are devoid of life force are referred to with the label life force.

source: ཆོས་ཐམས་ཅད་གསོ་བ་མེད་པ་ནི་གསོ་བའི་སྒྲས་བསྐྱེད་པའོ། །
en: All phenomena that are devoid of a soul are imagined with the label soul.

source: ཆོས་ཐམས་ཅད་གང་ཟག་མེད་པ་ནི་གང་ཟག་གི་སྒྲས་རྣམ་པར་བརྗོད་པའོ། །
en: All phenomena that are devoid of person are referred to with the label person.

source: ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་བྲལ་བའོ། །
en: All phenomena that are inconceivable are free from inconceivability.

source: ཆོས་ཐམས་ཅད་འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་ནི་དངོས་པོ་མེད་པའོ། །
en: All phenomena that are ultimately known to be free from desires are insubstantial.

source: ཆོས་ཐམས་ཅད་ཉེས་པ་མེད་པ་ནི་རིམས་དང་བྲལ་བའོ། །
en: All phenomena are faultless and free from diseases.

source: ཆོས་ཐམས་ཅད་གཏི་མུག་མེད་པ་ནི་ལུས་དང་བྲལ་བའོ། །
en: All phenomena are without delusion and incorporeal.

source: ཆོས་ཐམས་ཅད་གནས་པ་མེད་པ་ནི་གནས་པར་དམིགས་པ་མེད་པའོ། །
en: All phenomena are groundless and lack the apprehension of a ground.

source: ཆོས་ཐམས་ཅད་གནས་པ་མེད་པ་ནི་ནམ་མཁའི་རང་བཞིན་ལྟ་བུའོ། །
en: All phenomena are groundless and like the nature of space.

source: ཆོས་ཐམས་ཅད་གསོག་ནི་ཡུལ་ལ་དམིགས་པ་མེད་པའོ། །
en: All phenomena are unreal and lack the apprehension of objects.

source: ཆོས་ཐམས་ཅད་གསོ་བ་ནི་ཉོན་མོངས་པ་དང་བྲལ་བའོ། །
en: All phenomena are hollow and free from afflictions.

source: ཆོས་ཐམས་ཅད་འགྲོ་བ་མེད་པ་ནི་བྱེད་པ་པོ་དང་བྲལ་བའོ། །
en: All phenomena lack going and are without an agent.

source: ཆོས་ཐམས་ཅད་བླང་བ་མེད་པ་ནི་སེམས་པ་དང་བྲལ་བའོ། །
en: All phenomena lack adoption and are without volition.

source: ཆོས་ཐམས་ཅད་རློམ་སེམས་མེད་པ་ནི་སྒྱུ་མ་དང་བྲལ་བའོ། །
en: All phenomena are without thoughts and free from illusions.

source: ཆོས་ཐམས་ཅད་སྤྲོས་པ་མེད་པ་ནི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་འདུ་བྱེད་དང་བྲལ་བའོ། །ཏད་ཡ་ཐཱ། བེ་དི་ནི། བེ་དི་ནི། བེ་དི་ནི། པཎ་ཌི་ནི། པ་ཎ་ཌི་ནི། པཎ་ཌི་ནི། ཏྲི་ཛྙ་ནི། ཏྲི་ཛྙ་ནི། ཏྲི་ཛྙ་ནི། ཨུ་པ་དཱ་ནི། ཨུ་པ་དཱ་ནི། ཨུ་པ་དཱ་ནི། ན་པཱི་ནི། ན་པཱི་ནི། ན་པཱི་ནི། མུ་ཛི་ནི། མུ་ཛི་ནི། མུ་ཛི་ནི། ཨ་རིཥྛ། བ་རིཥྛ། ཧེ་ཏང་གྲ་མ། མ་ཧུ་ཤོ་ཙ། དྷ་རི་དྷ་རི། དྷཥྚེ་པྲ་དྷཥྚེ། ཨུ་རུ་ཀཱན་ཏེ། གམ་བྷི་རི། ཨ་བརྟ་ནི་བརྟ་ནི། མེ་བ་ཨ་བརྟ་ནི། ཨི་ཧ་ནི། བརྟ་ནི། ཀཱན་ཏེ། སརྦ་ཀཱན་ཏེ། ཧྲྀ་ད་ཡ་ཀཱན་ཏི། བི་ར་ཛེ། བ་ར་ཛེ།
en: All phenomena lack elaboration and are free from physical, verbal, and mental formations.

source: བ་ར་བིར་ཛེ། སྐན་དྷ་བ་མེ། ཨ་ཡ་ཏན་ར་ཧེ་བྷ་ཏུ་ས་རེ། དརྦ་ཕལྒུ། དྷརྨ་རཱ་ཛེ་ར་པྲེ་ཀྵི་ཏེ་སྭཱ་ཧཱ།
en: tadyathā | vedini vedini vedini paṇḍini paṇḍini paṇḍini trijñani trijñani trijñani upadāni upadāni upadāni napīni napīni napīni mujini mujini mujini ariṣṭha variṣṭha hetaṅgrama mahuśoca dhari dhari dhaṣṭe pradhaṣṭe urukānte gambhiri avartani vartanim eva avartani iha nivartani kānte sarvakānte hṛdayakānte viraje varaje varaviraje skandhavame ayatanarahe bhatusare darvaphalgu dharmarājer prekṣite svāhā “ ‘ “Go now to tame the views of all those corrupted beings.” ’

source: སེམས་ཅན་ངན་པ་རྣམས་ལྟ་བ་དང་འདུལ་བའི་ཕྱིར་འགྲོའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་གི་དུས་ལ་དབབ་པར་ཤེས་ན་སོང་ཤིག །
en: “The Blessed One then said, ‘Noble sons, the time has come for you to leave.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པའི་འོད་ལ་མེ་ཏོག་བན་དུ་ཆུན་པོ་གཉིས་པོ་སྐྲའི་རལ་པ་ལ་བཏགས་ཏེ།
en: He tied the two bouquets of pentapetes flowers around locks of hair of the bodhisattva Light of Immaculate Splendor and the other bodhisattvas.

source: རིགས་ཀྱི་བུ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་ལྔ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་ཕུང་པོ་དེ་ལ་རྐང་པ་གཉིས་ས་ལ་བཙུགས་ཏེ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་གཡས་ཕྱོགས་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Together with 95,000 noble sons, they knelt on both knees, prostrated to the feet of the Thus-Gone One Glorious Heap, and then circumambulated him three times clockwise.

source: ཡུད་ཙམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ནས་གྲོང་ཁྱེར་གང་ལ་གླིང་བཞི་པའི་དབུས་ཀྱི་རྒྱལ་པོ་དེ་འདུག་པ་དེར་ཉེ་བར་ཕྱིན་ནས།
en: Then, they instantly set out for the buddha realm called Apportioned and came upon the city in the middle of the four-continent world where the king was residing.

source: དེ་ནུབ་བདུན་པའི་ཐ་མ་ན་དེ་དག་གི་མདུན་ན་འདུག་པར་གྱུར་ནས་དེ་དག་ལ་བལྟས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: After seven days had passed, he was finally present before them.

source: རྒྱལ་པོ་ཆེན་པོ་ཚུར་སྤྱོན།
en: As he looked at them, they said, “Great King, please come here!

source: རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ། །
en: Great King, this is excellent!

source: བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལས་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་བཟོད་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་བཟོད་པའི་མཆོག་དཔལ་གྱི་ཕུང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཤིང་འཚོ་སྐྱོང་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: In the north, beyond 920,000,000 buddha realms, there is a universe called Acceptance where the thus-gone one, the worthy, perfect Buddha King of the Glorious Heap of Supreme Acceptance, resides, thrives, offers sustenance, and teaches the Dharma.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཆོས་ཀྱི་གཞུང་འདི་བསྟན་པའི་ཕྱིར་བདག་ཅག་ཁྱོད་ཀྱི་གན་དུ་བཏང་ངོ་། །
en: That thus-gone one has sent us here to teach you this Dharma scripture.

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་རང་བཞིན་གྱིས་ཉོན་མོངས་པ་མེད་པ་གཉིས་སུ་མེད་པའི་སྒོས་ཡོངས་སུ་ཤེས་པར་བྱ་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཇི་ལྟ་བ་དེ་ལྟར་བདག་གི་ཁམས་དང་དེ་ལྟར་སེམས་ཅན་གྱི་ཁམས་ཀྱང་གཉིས་སུ་མེད་པའི་སྒོས་ཡོངས་སུ་ཤེས་པར་བྱའོ། །
en: Great King, just as the entire realm of phenomena that is naturally devoid of affliction should be understood through the gateway of nonduality, the elements related to the self and the elements related to sentient beings are just like the realm of phenomena in that they too should be understood through the gateway of nonduality.

source: དེ་ལྟར་མིག་གིས་གཟུགས་ཀྱི་སྒོ་ལ་ཡང་འཕོས་པ་མེད་ཅིང་རྣམ་པར་ཕྱེ་བ་མེད་པ་གཉིས་སུ་མེད་པའི་ཆོས་སྟོན་པར་འགྱུར་བ་ནས་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་སྒོའི་བར་དུ་འཕོས་པ་མེད་ཅིང་རྣམ་པར་ཕྱེ་བ་མེད་པས་གཉིས་སུ་མེད་པའི་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: Similarly, the gateway of the forms perceived by the eyes will reveal nonduality, the absence of passing away, and the absence of being reborn, up to the gateway of mental consciousness revealing nonduality, the absence of passing away, and the absence of being reborn.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་སེམས་ཅན་མེད་པ་ནི་སེམས་ཅན་དང་བྲལ་བའོ། །ཆོས་ཐམས་ཅད་སྲོག་མེད་པ་ནི་སྲོག་གི་སྒྲས་བསྟན་པ་ནས་ཆོས་ཐམས་ཅད་སྤྲོས་པ་མེད་པ་ནི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་འདུ་བྱེད་དང་བྲལ་བའི་བར་དུའོ། །ཏད་ཡ་ཐཱ། བེ་དི་ནི། བེ་དི་ནི། བེ་དི་ནི། པཎ་ཌི་ནི། པཎ་ཌི་ནི། པཎ་ཌི་ནི། ཏྲི་ཛྙ་ནི། ཏྲི་ཛྙ་ནི། ཏྲི་ཛྙ་ནི། ཨུ་པ་དཱ་ནི། ཨུ་པ་དཱ་ནི། ཨུ་པ་དཱ་ནི། ན་པཱི་ནི། ན་པཱི་ནི། ན་པཱི་ནི། མུ་ཛི་ནི། མུ་ཛི་ནི། མུ་ཛི་ནི། ཨ་རིཥྛ་བ་རིཥྛ། ཧེ་ཏང་གྲ་མ། མ་ཧུ་ཤོ་ཙ། དྷ་རི་དྷ་རི། དྷཥྚེ་པྲ་དྷཥྚེ། ཨུ་རུ་ཀཱན་ཏེ། གམ་བྷི་རེ། ཨ་བརྟ་ནི། བརྟ་ནི། མེ་བ་ཨ་བརྟ་ནི། ཨི་ཧ་ནི་བརྟ་ནི། ཀཱན་ཏེ། སརྦ་ཀཱན་ཏེ། ཧྲཱི་ད་ཡ་ཀཱན་ཏེ། བི་ར་ཛེ། བ་ར་ཛེ། བ་ར་ཛེ། བ་ར་བི་ཛེ། སྐན་དྷ་བ་མེ།
en: Because, great King, all phenomena lack being and are free from being, all phenomena that lack a life force are referred to with the label life force, right up to the fact that all phenomena are without elaboration and free from physical, verbal, and mental formations.” ’

source: ཨ་ཡ་ཏ་ན་ར་ཧེ། བྷ་ཏུ་ས་རེ། དཪྤ་ཕལྒུ། དྷརྨ་རཱ་ཛེ་ར་པྲ་ཀྵི་ཏེ་སྭཱ་ཧཱ། རྒྱལ་པོ་བསོད་ནམས་ཀྱི་འོད་ཟེར་མཛོད་ལ་སེམས་ཅན་དེ་དག་གིས་སྔགས་ཀྱི་ཚིག་འདི་དག་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ལན་དྲུག་ཏུ་གཡོས་སོ། །
en: tadyathā | vedini vedini vedini paṇḍini paṇḍini paṇḍini trijñani trijñani trijñani upadāni upadāni upadāni napīni napīni napīni mujini mujini mujini ariṣṭha variṣṭha hetaṅ grama mahuśoca dhari dhari dhaṣṭe pradhaṣṭe urukānte gambhire avartani vartanim eva avartani iha nivartani kānte sarvakānte hṛdayakānte viraje varaje varaje varaviraje skandhavame ayatanarahe bhatusare darpaphalgu dharmarājer prekṣite svāhā “As soon as those beings had uttered the words of this mantra to King Treasury of Light Rays of Merit, the buddha realm Apportioned shook in six ways.

source: སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མ་བརྡབས་པར་རང་འཁྲོལ་ལོ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་སྤོས་ཀྱི་ཕྱེ་མའི་ཆར་དག་ཀྱང་ཕབ་བོ། །
en: The tunes of myriads of cymbals resounded without anyone playing them, and showers of divine flowers and incense powders fell from the sky.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ལྷ་དང་མི་ཐམས་ཅད་ཀུན་ཏུ་དགའ་སྟེ། བ་སྤུའི་ཁུང་བུ་གཡོས་ཤིང་རྒ་ཤི་ལས་ཐར་པར་བསམས་པར་གྱུར་ཏོ། །
en: All the gods and humans living in that buddha realm were delighted, their hair stood on end, and they thought they were liberated from old age and death.

source: དེ་དག་ཀྱང་བདག་གི་ལུས་ལས་མེ་ཏོག་བན་དུའི་ཐོར་ཚུགས་བཀྲོལ་ཏེ་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ལ་ཕུལ་ནས་སྨྲས་པ།
en: “The bodhisattvas then let loose their crowns of pentapetes flowers from their bodies, and they offered those flowers to King Treasury of Light Rays of Merit, saying, ‘The Thus-Gone One sends you these flowers.

source: དེ་བཞིན་གཤེགས་པ་དེས་མེ་ཏོག་བན་དུ་བཏང་ཞིང་མུ་སྟེགས་ཅན་སྒྲིབ་པའི་ཕྱིར་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པའི་སྔགས་ཀྱི་ཚིག་བརྗོད་པ་འདི་དག་ཀྱང་བཏང་ངོ་། །
en: He also sends those words of the mantra of the acceptance of taming beings with the sky-colored method for non-Buddhists who are hindered.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སྔགས་ཀྱི་ཚིག་འདི་སྒོམས་ཤིག་དང་།
en: Great King, meditate on the words of this mantra!

source: རྒྱལ་པོ་ཆེན་པོ་སྔགས་ཀྱི་ཚིག་འདི་དག་གིས་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་བཟོད་པ་དེས་སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་། འཁྲུག་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་།
en: Great King, through the words of this mantra, you will achieve the acceptance of taming beings with the sky-colored method of perfect conduct.

source: ལས་ཀྱི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་ལས་ཀྱི་སྒྲིབ་པ་རབ་དང་། འབྲིང་དང་། ཐ་མ་ཐམས་ཅད་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །
en: With this acceptance, Great King, you will completely eliminate the hindrances and distresses of beings and all severe, middling, and lesser afflictive hindrances, karmic hindrances, hindrances to the Dharma, and hindrances of karma and of the afflictions.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་ལམ་བསྟན་པ་སྟོན་པར་འགྱུར་རོ། །
en: Great King, you will also act as a virtuous friend and show the path to many myriads of beings.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་མང་པོ་ལ་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་སྨིན་པར་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Great King, you will ripen countless myriads of beings through the three vehicles, and you will swiftly awaken to unsurpassed and perfect buddhahood.’

source: དེ་དག་གི་ཚིག་ངས་ཐོས་པས་མཆོག་ཏུ་མགུ་རངས་རབ་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། དྲི་དང་། སྤོས་དང་། བྱུག་པ་དང་།
en: “When I heard those words, I became utterly elated, thrilled, and delighted, and I made an offering to those bodhisattvas with a variety of the most magnificent flowers, garlands, perfumes, incense, ointments, parasols, banners, flags, and music.

source: གདུགས་དང་།
en: I knelt on both knees and prostrated to their feet.
